import 'package:loading_management/ctrl/state/article_list.dart';

final stubInitArticleList = [
  Article(
    id: 1,
    title: 'シーシャの楽しみ方：初心者ガイド',
    detail: 'シーシャの吸い方についての記事です。リラックスできる煙の楽しみ方から、フレーバーの選び方まで詳しく解説します。',
  ),
  Article(
    id: 2,
    title: 'コーヒーの淹れ方マスタークラス',
    detail:
        'この記事では、プロのバリスタが教えるコーヒーの淹れ方を紹介します。豆の選び方から、抽出のコツまで、美味しいコーヒーを淹れるための秘訣を学びましょう。',
  ),
  Article(
    id: 3,
    title: 'テクノロジーの進化と未来の生活',
    detail:
        'テクノロジーは日々進化しており、私たちの生活を大きく変えています。この記事では、最新のテクノロジートレンドと、それが私たちの未来にどのような影響を与えるかを探ります。',
  ),
];

final stubAddArticleList = [
  Article(
    id: 4,
    title: '星空の下でリフレッシュ：究極のキャンプ体験',
    detail: 'キャンプは自然の中で過ごす最高の休息方法。焚火の温もりと星空の美しさに癒され、日常の喧騒を忘れることができます。',
  ),
  Article(
    id: 5,
    title: '健康的な生活のための簡単な運動ルーチン',
    detail:
        '毎日の忙しさの中で健康を維持することは難しいかもしれません。この記事では、忙しい人でも簡単に取り入れられる運動ルーチンを紹介します。',
  ),
  Article(
    id: 6,
    title: '世界の絶景を巡る旅：あなたのバケットリストに追加すべき場所',
    detail: '世界には息をのむような美しい場所がたくさんあります。この記事では、一生に一度は訪れたい絶景スポットをピックアップして紹介します。',
  ),
];
